In [1]:
import numpy as np
import pandas as pd 
v1 = np.array([1 ,3 ,6 ,np.NaN , 7 ,1 ,np.NaN ,9 , 15])
v2 = np.array([7 ,np.NaN ,5 ,8 ,12 ,np.NaN ,np.NaN ,2 ,3])
v3 = np.array([np.NaN ,12 ,5 ,6 ,14 ,7 ,np.NaN , 2 ,31])
df = pd.DataFrame(
    {
        "v1" : v1,
        "v2" : v2,
        "v3" : v3
        
    }

)

In [26]:
df["v1"].fillna(df["v1"].mean())

0     1.0
1     3.0
2     6.0
3     6.0
4     7.0
5     1.0
6     6.0
7     9.0
8    15.0
Name: v1, dtype: float64

In [3]:
df

     v1    v2    v3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [10]:
df.apply(lambda x : x.fillna(x.mean()))

     v1         v2    v3
0   1.0   7.000000  11.0
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0

In [12]:
# ikinci yol

In [16]:
df.fillna(df.mean()[:])

     v1         v2    v3
0   1.0   7.000000  11.0
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0

In [18]:
df.fillna(df.mean()["v1" :"v2"])

     v1         v2    v3
0   1.0   7.000000   NaN
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667   NaN
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0

In [21]:
df["v3"].fillna(df.mean()["v3"])

0    11.0
1    12.0
2     5.0
3     6.0
4    14.0
5     7.0
6    11.0
7     2.0
8    31.0
Name: v3, dtype: float64

In [22]:
# ücüncü yol

In [24]:
df.where(pd.notna(df) ,df.mean() ,axis = "columns")

     v1         v2    v3
0   1.0   7.000000  11.0
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0